function Ploss=Bearcal(N,D,u,Q,type)
% 计算轴承损耗功率
%转速，D直径，u动力粘度，q滑油流量，type轴承类型
switch type
    case 0
        Ploss=0;
    case 1
        %滚珠轴承
        Ploss=4.87e-15*D^3.95*N^1.75*u^0.4*1000+3.19e-10*N*D*Q*1000;
    case 2   
        %滚柱轴承
        Ploss=2.07e-15*D^3.95*N^1.75*u^0.4*1000+1.56e-10*N*D*Q*1000;
    case 3   
        %液压径向轴承
        Ploss=2.48e-14*D^3.95*N^1.75*u^0.4*1000+1.87e-9*N*D*Q*1000;
    case 4   
        %液压止推轴承
        Ploss=5.84e-14*D^3.95*N^1.75*u^0.4*1000+3.83e-9*N*D*Q*1000;
end
end