%自定义升降转速率大小：最大最小油气比大小，油气比开环控制时的油气比大小。
%环境温度和核心机换算转速组成二维插值表
%所有单位均采用国际单位
%% 前馈控制
%定义升转速率
maxXdot_HPShaft=7000:2000:15000;%核心机换算转速
maxXdot_Tem=[273.15,303.15];%环境温度/K
maxXdot_value=[800,600
    800,700
    800,800    
    800,900
    800,1000];%升降转速率:每一列对应一个温度，每一行对应一个转速
%定义降转速率
minXdot_HPShaft=7000:2000:15000;%核心机换算转速
minXdot_Tem=[273.15,303.15];%环境温度/K
minXdot_value=[-800,-600
    -800,-700
    -800,-800    
    -800,-900
    -800,-1000];

%定义最大油气比
maxWfP3_HPShaft=[0,999999];%核心机换算转速
maxWfP3_Tem=288.15;%环境温度/K
maxWfP3_value=[8e-7
    8e-7];%

%定义最小油气比
minWfP3_HPShaft=[0,999999];%核心机换算转速
minWfP3_Tem=288.15;%环境温度/K
minWfP3_value=[0.0001e-7
    0.0001e-7];
%% 油气比控制
%定义升工况油气比
maxWfP3_open_HPShaft=[0,999999];%核心机换算转速
maxWfP3_open_Tem=[273.15,303.15];%环境温度/K
maxWfP3_open_value=[5e-7,5e-7
    5e-7,5e-7];%每一列对应一个温度，每一行对应一个转速

%定义降工况油气比
minWfP3_open_HPShaft=[0,999999];%核心机换算转速
minWfP3_open_Tem=[273.15,303.15];%环境温度/K
minWfP3_open_value=[2.5e-7,2.5e-7
    2.5e-7,2.5e-7];